# C:\ProgramData\Anaconda3\envs\py35_32\python.exe C:/Users/COM/git/learningTrade/source/condition_check.py
# [2210][0]
# [2990][0]
# [5690][0]
# [6490][0]
# [12630][0]
# [14820][0]
# [16580][0]
# [19170][0]
# [32350][0]
# BUY
#  code[33180.0] time[90300.0] 등락율[2.79] 거래량차이[284709] 남은매수대금[256.59113916] 현재_차이[90124] 이전_차이[-172726] DIFF_차이[262850] 체결강도[135.16][-42.22222222222222] 시간차이[100]
# ============== SUCCESS Sell[9200][9340][1.1917391304347826]
# [33180][1.1917391304347826]
# SELL SUCCESS profit[1.1917391304347826]
#  code[33180.0] time[90400.0] 등락율[4.36] 거래량차이[535092] 남은매수대금[-301.0427592] 현재_차이[-56260] 이전_차이[-17260] DIFF_차이[-39000] 체결강도[147.59][-4.761904761904762] 시간차이[100]
# BUY
#  code[33180.0] time[90900.0] 등락율[3.91] 거래량차이[358543] 남은매수대금[194.99361055] 현재_차이[54385] 이전_차이[-242715] DIFF_차이[297100] 체결강도[129.19][15.503875968992247] 시간차이[0]
# ============== FAILED Sell[9300][9060][-2.9106451612903226]
# [33180][-1.71890603085554]
# SELL FAILED profit[-1.71890603085554]
#  code[33180.0] time[92600.0] 등락율[1.23] 거래량차이[229933] 남은매수대금[125.90901147] 현재_차이[54759] 이전_차이[151663] DIFF_차이[-96904] 체결강도[85.62][4.705882352941177] 시간차이[0]
# [33180][-1.71890603085554]
# >>DAY[20191106] - Profit[-1.71890603085554]
# ======================================================
# [2320][0]
# [2780][0]
# [4170][0]
# [7700][0]
# [9580][0]
# [19170][0]
# [20000][0]
# BUY
#  code[33180.0] time[90200.0] 등락율[0.11] 거래량차이[185455] 남은매수대금[108.17775605] 현재_차이[58331] 이전_차이[44168] DIFF_차이[14163] 체결강도[67.25][17.91044776119403] 시간차이[0]
# ============== FAILED Sell[9260][9060][-2.4898272138228945]
# [33180][-2.4898272138228945]
# SELL FAILED profit[-2.4898272138228945]
#  code[33180.0] time[91300.0] 등락율[-2.05] 거래량차이[169378] 남은매수대금[438.80250326] 현재_차이[259067] 이전_차이[155920] DIFF_차이[103147] 체결강도[46.17][4.3478260869565215] 시간차이[100]
# [33180][-2.4898272138228945]
# [74610][0]
# [229640][0]
# [249420][0]
# >>DAY[20191107] - Profit[-2.4898272138228945]
# ======================================================
# [1210][0]
# BUY
#  code[1360.0] time[93600.0] 등락율[12.55] 거래량차이[586492] 남은매수대금[245.69322864] 현재_차이[41892] 이전_차이[-58173] DIFF_차이[100065] 체결강도[124.28][-0.8064516129032259] 시간차이[100]
# ============== FAILED Sell[5830][5710][-2.388319039451115]
# [1360][-2.388319039451115]
# SELL FAILED profit[-2.388319039451115]
#  code[1360.0] time[93900.0] 등락율[10.23] 거래량차이[258154] 남은매수대금[139.91688646] 현재_차이[54199] 이전_차이[74112] DIFF_차이[-19913] 체결강도[115.37][2.608695652173913] 시간차이[100]
# [1360][-2.388319039451115]
# [2990][0]
# [2995][0]
# BUY
#  code[3280.0] time[93400.0] 등락율[4.17] 거래량차이[285584] 남은매수대금[783.53968576] 현재_차이[274364] 이전_차이[-177929] DIFF_차이[452293] 체결강도[69.62][-0.0] 시간차이[100]
# ============== SUCCESS Sell[525][531][0.8128571428571427]
# [3280][0.8128571428571427]
# SELL SUCCESS profit[0.8128571428571427]
#  code[3280.0] time[94400.0] 등락율[5.36] 거래량차이[78707] 남은매수대금[-279.77426341] 현재_차이[-355463] 이전_차이[-75570] DIFF_차이[-279893] 체결강도[70.87][-1.4285714285714286] 시간차이[200]
# BUY
#  code[3280.0] time[102700.0] 등락율[0.4] 거래량차이[207772] 남은매수대금[405.415115] 현재_차이[195125] 이전_차이[181773] DIFF_차이[13352] 체결강도[61.18][1.639344262295082] 시간차이[100]
# ============== SUCCESS Sell[506][517][1.8439130434782611]
# [3280][2.656770186335404]
# SELL SUCCESS profit[2.656770186335404]
#  code[3280.0] time[103100.0] 등락율[2.58] 거래량차이[296301] 남은매수대금[-409.23020013] 현재_차이[-138113] 이전_차이[173993] DIFF_차이[-312106] 체결강도[64.42][-3.125] 시간차이[100]
# [3280][2.656770186335404]
# [3350][0]
# BUY
#  code[6490.0] time[93400.0] 등락율[5.86] 거래량차이[388863] 남은매수대금[540.43013151] 현재_차이[138977] 이전_차이[117297] DIFF_차이[21680] 체결강도[104.5][2.8846153846153846] 시간차이[100]
# ============== SUCCESS Sell[3975][4025][0.9278616352201257]
# [6490][0.9278616352201257]
# SELL SUCCESS profit[0.9278616352201257]
#  code[6490.0] time[95100.0] 등락율[7.19] 거래량차이[375082] 남은매수대금[-468.48116882] 현재_차이[-124901] 이전_차이[-143958] DIFF_차이[19057] 체결강도[99.28][-1.0101010101010102] 시간차이[200]
# BUY
#  code[6490.0] time[100700.0] 등락율[10.39] 거래량차이[909645] 남은매수대금[312.50853975] 현재_차이[34355] 이전_차이[-197216] DIFF_차이[231571] 체결강도[103.97][-2.912621359223301] 시간차이[200]
# ============== SUCCESS Sell[4145][4235][1.8412907117008444]
# [6490][2.7691523469209702]
# SELL SUCCESS profit[2.7691523469209702]
#  code[6490.0] time[100800.0] 등락율[12.78] 거래량차이[1459840] 남은매수대금[39.2404992] 현재_차이[2688] 이전_차이[34355] DIFF_차이[-31667] 체결강도[107.11][-3.7383177570093458] 시간차이[100]
# BUY
#  code[6490.0] time[102200.0] 등락율[17.98] 거래량차이[901805] 남은매수대금[414.53270435] 현재_차이[45967] 이전_차이[-184161] DIFF_차이[230128] 체결강도[108.03][1.8518518518518516] 시간차이[200]
# ============== FAILED Sell[4430][4305][-3.1516704288939055]
# [6490][-0.38251808197293524]
# SELL FAILED profit[-0.38251808197293524]
#  code[6490.0] time[102700.0] 등락율[14.65] 거래량차이[563083] 남은매수대금[179.06602483] 현재_차이[31801] 이전_차이[-45948] DIFF_차이[77749] 체결강도[103.9][1.941747572815534] 시간차이[100]
# [6490][-0.38251808197293524]
# [10770][0]
# [16380][0]
# [20560][0]
# [25620][0]
# [69460][0]
# [123690][0]
# [214420][0]
# [500030][0]
# [500035][0]
# [500036][0]
# [530062][0]
# [550045][0]
# >>DAY[20191108] - Profit[-0.11406693508864629]
# ======================================================
# [1060][0]
# [1525][0]
# [1527][0]
# BUY
#  code[3560.0] time[125600.0] 등락율[12.85] 거래량차이[1186997] 남은매수대금[799.14573025] 현재_차이[67325] 이전_차이[-52486] DIFF_차이[119811] 체결강도[142.63][1.4084507042253522] 시간차이[100]
# ============== SUCCESS Sell[2020][2040][0.66009900990099]
# [3560][0.66009900990099]
# SELL SUCCESS profit[0.66009900990099]
#  code[3560.0] time[125800.0] 등락율[13.97] 거래량차이[640956] 남은매수대금[-159.14296524] 현재_차이[-24829] 이전_차이[-20229] DIFF_차이[-4600] 체결강도[143.21][-2.7972027972027975] 시간차이[100]
# BUY
#  code[3560.0] time[125900.0] 등락율[17.88] 거래량차이[1674138] 남은매수대금[1681.90600032] 현재_차이[100464] 이전_차이[-24829] DIFF_차이[125293] 체결강도[147.28][-2.7210884353741496] 시간차이[100]
# ============== SUCCESS Sell[2110][2150][1.5657345971563978]
# [3560][2.225833607057388]
# SELL SUCCESS profit[2.225833607057388]
#  code[3560.0] time[130000.0] 등락율[20.11] 거래량차이[1464845] 남은매수대금[-264.9904605] 현재_차이[-18090] 이전_차이[100464] DIFF_차이[-118554] 체결강도[143.23][2.7972027972027975] 시간차이[4100]
# BUY
#  code[3560.0] time[142800.0] 등락율[11.73] 거래량차이[974370] 남은매수대금[1785.435588] 현재_차이[183240] 이전_차이[-173768] DIFF_차이[357008] 체결강도[114.43][1.7543859649122808] 시간차이[200]
# -------------Not Sell [-0.08000000000000002]
# [3560][2.145833607057388]
# [7280][0]
# [20000][0]
# BUY
#  code[24900.0] time[90400.0] 등락율[16.73] 거래량차이[526250] 남은매수대금[148.749825] 현재_차이[28266] 이전_차이[0] DIFF_차이[28266] 체결강도[133.25][0] 시간차이[100]
# ============== SUCCESS Sell[1430][1465][2.1175524475524474]
# [24900][2.1175524475524474]
# SELL SUCCESS profit[2.1175524475524474]
#  code[24900.0] time[90500.0] 등락율[19.59] 거래량차이[573138] 남은매수대금[-263.39703066] 현재_차이[-45957] 이전_차이[28266] DIFF_차이[-74223] 체결강도[144.54][-7.638888888888889] 시간차이[100]
# [24900][2.1175524475524474]
# [26940][0]
# [37560][0]
# [39570][0]
# [69460][0]
# [72130][0]
# [163560][0]
# [195920][0]
# [253250][0]
# [267850][0]
# [334700][0]
# [500022][0]
# [500032][0]
# [530038][0]
# >>DAY[20191111] - Profit[4.263386054609835]
# ======================================================
# [1360][0]
# [1527][0]
# [5257][0]
# [6390][0]
# [00781K][0]
# [12450][0]
# BUY
#  code[20560.0] time[111300.0] 등락율[9.43] 거래량차이[706481] 남은매수대금[362.1421606] 현재_차이[51260] 이전_차이[-513345] DIFF_차이[564605] 체결강도[158.89][4.430379746835443] 시간차이[100]
# ============== SUCCESS Sell[6380][6440][0.6104388714733542]
# [20560][0.6104388714733542]
# SELL SUCCESS profit[0.6104388714733542]
#  code[20560.0] time[111800.0] 등락율[10.46] 거래량차이[307859] 남은매수대금[-1664.02715244] 현재_차이[-540516] 이전_차이[-636132] DIFF_차이[95616] 체결강도[147.59][-0.6802721088435374] 시간차이[100]
# BUY
#  code[20560.0] time[142600.0] 등락율[17.67] 거래량차이[2345659] 남은매수대금[2091.8586962] 현재_차이[89180] 이전_차이[-460448] DIFF_차이[549628] 체결강도[130.81][-3.0769230769230766] 시간차이[100]
# ============== FAILED Sell[6860][6680][-2.953906705539359]
# [20560][-2.3434678340660047]
# SELL FAILED profit[-2.3434678340660047]
#  code[20560.0] time[144200.0] 등락율[14.58] 거래량차이[903681] 남은매수대금[2220.85027836] 현재_차이[245756] 이전_차이[56846] DIFF_차이[188910] 체결강도[121.09][0.8264462809917356] 시간차이[100]
# [20560][-2.3434678340660047]
# [33250][0]
# [39570][0]
# [81660][0]
# [97950][0]
# [118000][0]
# [181480][0]
# [267850][0]
# [317400][0]
# [334700][0]
# [500032][0]
# [530038][0]
# >>DAY[20191112] - Profit[-2.3434678340660047]
# ======================================================
# [1065][0]
# [1210][0]
# [1525][0]
# [1527][0]
# [3780][0]
# [4250][0]
# [5725][0]
# [5750][0]
# [9415][0]
# [17370][0]
# BUY
#  code[20560.0] time[90400.0] 등락율[3.95] 거래량차이[1054520] 남은매수대금[539.966966] 현재_차이[51205] 이전_차이[-99580] DIFF_차이[150785] 체결강도[148.13][43.91891891891892] 시간차이[100]
# ============== FAILED Sell[6840][6700][-2.376783625730994]
# [20560][-2.376783625730994]
# SELL FAILED profit[-2.376783625730994]
#  code[20560.0] time[90900.0] 등락율[1.82] 거래량차이[604955] 남은매수대금[-135.72165425] 현재_차이[-22435] 이전_차이[-188781] DIFF_차이[166346] 체결강도[100.0][15.0] 시간차이[100]
# [20560][-2.376783625730994]
# BUY
#  code[39570.0] time[90400.0] 등락율[6.3] 거래량차이[677900] 남은매수대금[222.656255] 현재_차이[32845] 이전_차이[0] DIFF_차이[32845] 체결강도[114.06][0] 시간차이[100]
# ============== SUCCESS Sell[14350][15200][5.593344947735192]
# [39570][5.593344947735192]
# SELL SUCCESS profit[5.593344947735192]
#  code[39570.0] time[90500.0] 등락율[12.59] 거래량차이[313095] 남은매수대금[-35.3546874] 현재_차이[-11292] 이전_차이[32845] DIFF_차이[-44137] 체결강도[156.84][-26.923076923076923] 시간차이[100]
# [39570][5.593344947735192]
# [51630][0]
# [77500][0]
# [82740][0]
# [112610][0]
# [118000][0]
# [163560][0]
# BUY
#  code[298690.0] time[90300.0] 등락율[5.15] 거래량차이[914361] 남은매수대금[469.83525624] 현재_차이[51384] 이전_차이[-343284] DIFF_차이[394668] 체결강도[80.93][31.25] 시간차이[100]
# ============== SUCCESS Sell[9800][9900][0.6904081632653061]
# [298690][0.6904081632653061]
# SELL SUCCESS profit[0.6904081632653061]
#  code[298690.0] time[90600.0] 등락율[6.22] 거래량차이[618814] 남은매수대금[-3356.85555324] 현재_차이[-542466] 이전_차이[-68751] DIFF_차이[-473715] 체결강도[90.56][-14.444444444444445] 시간차이[100]
# [298690][0.6904081632653061]
# [500041][0]
# >>DAY[20191113] - Profit[3.906969485269504]
# ======================================================
# BUY
#  code[1360.0] time[100300.0] 등락율[6.43] 거래량차이[776051] 남은매수대금[322.03012296] 현재_차이[41496] 이전_차이[0] DIFF_차이[41496] 체결강도[41.14][0] 시간차이[0]
# ============== SUCCESS Sell[5050][5190][2.442277227722772]
# [1360][2.442277227722772]
# SELL SUCCESS profit[2.442277227722772]
#  code[1360.0] time[100400.0] 등락율[9.38] 거래량차이[168637] 남은매수대금[-142.90973928] 현재_차이[-84744] 이전_차이[41496] DIFF_차이[-126240] 체결강도[69.01][-40.57971014492754] 시간차이[100]
# [1360][2.442277227722772]
# [2720][0]
# [3550][0]
# [3850][0]
# [5110][0]
# [19170][0]
# BUY
#  code[33180.0] time[100200.0] 등락율[9.87] 거래량차이[578635] 남은매수대금[169.81201345] 현재_차이[29347] 이전_차이[-15813] DIFF_차이[45160] 체결강도[203.14][-2.4630541871921183] 시간차이[0]
# ============== SUCCESS Sell[9240][9360][0.9687012987012986]
# [33180][0.9687012987012986]
# SELL SUCCESS profit[0.9687012987012986]
#  code[33180.0] time[100300.0] 등락율[11.3] 거래량차이[742857] 남은매수대금[506.67304542] 현재_차이[68206] 이전_차이[29347] DIFF_차이[38859] 체결강도[217.07][-6.451612903225807] 시간차이[100]
# [33180][0.9687012987012986]
# [35420][0]
# [63160][0]
# [336260][0]
# >>DAY[20191114] - Profit[3.4109785264240706]
# ======================================================
# [3280][0]
# [7110][0]
# BUY
#  code[8350.0] time[92800.0] 등락율[0.37] 거래량차이[228255] 남은매수대금[543.4842852] 현재_차이[238104] 이전_차이[204206] DIFF_차이[33898] 체결강도[73.04][4.109589041095891] 시간차이[100]
# ============== SUCCESS Sell[5390][5450][0.7831725417439703]
# [8350][0.7831725417439703]
# SELL SUCCESS profit[0.7831725417439703]
#  code[8350.0] time[92900.0] 등락율[1.49] 거래량차이[70749] 남은매수대금[-12.42776934] 현재_차이[-17566] 이전_차이[76250] DIFF_차이[-93816] 체결강도[73.18][-1.36986301369863] 시간차이[0]
# [8350][0.7831725417439703]
# [11390][0]
# [13360][0]
# [71970][0]
# [72130][0]
# [336260][0]
# [33626K][0]
# [33626L][0]
# >>DAY[20191118] - Profit[0.7831725417439703]
# ======================================================
# [140][0]
# BUY
#  code[3280.0] time[91400.0] 등락율[3.11] 거래량차이[1057579] 남은매수대금[440.36531981] 현재_차이[41639] 이전_차이[-133870] DIFF_차이[175509] 체결강도[93.56][-2.150537634408602] 시간차이[100]
# ============== SUCCESS Sell[896][905][0.6744642857142855]
# [3280][0.6744642857142855]
# SELL SUCCESS profit[0.6744642857142855]
#  code[3280.0] time[91400.0] 등락율[4.14] 거래량차이[256558] 남은매수대금[303.97248398] 현재_차이[118481] 이전_차이[41639] DIFF_차이[76842] 체결강도[94.32][-1.0638297872340425] 시간차이[0]
# BUY
#  code[3280.0] time[91900.0] 등락율[4.26] 거래량차이[736647] 남은매수대금[589.89955113] 현재_차이[80079] 이전_차이[-47751] DIFF_차이[127830] 체결강도[96.14][5.208333333333334] 시간차이[100]
# ============== SUCCESS Sell[906][919][1.104878587196468]
# [3280][1.7793428729107534]
# SELL SUCCESS profit[1.7793428729107534]
#  code[3280.0] time[91900.0] 등락율[5.75] 거래량차이[231050] 남은매수대금[197.4114305] 현재_차이[85441] 이전_차이[80079] DIFF_차이[5362] 체결강도[97.81][-1.0309278350515465] 시간차이[0]
# BUY
#  code[3280.0] time[93200.0] 등락율[13.35] 거래량차이[778900] 남은매수대금[789.578719] 현재_차이[101371] 이전_차이[51442] DIFF_차이[49929] 체결강도[106.18][-1.8867924528301885] 시간차이[100]
# ============== SUCCESS Sell[985][997][0.8882741116751269]
# [3280][2.66761698458588]
# SELL SUCCESS profit[2.66761698458588]
#  code[3280.0] time[93300.0] 등락율[14.73] 거래량차이[534553] 남은매수대금[-3427.06739277] 현재_차이[-641109] 이전_차이[9460] DIFF_차이[-650569] 체결강도[105.92][-1.9047619047619047] 시간차이[0]
# BUY
#  code[3280.0] time[93500.0] 등락율[10.59] 거래량차이[618246] 남은매수대금[322.79860152] 현재_차이[52212] 이전_차이[37137] DIFF_차이[15075] 체결강도[103.02][1.941747572815534] 시간차이[0]
# ============== SUCCESS Sell[961][974][1.0227575442247658]
# [3280][3.690374528810646]
# SELL SUCCESS profit[3.690374528810646]
#  code[3280.0] time[93600.0] 등락율[12.08] 거래량차이[328757] 남은매수대금[6.3778858] 현재_차이[1940] 이전_차이[52212] DIFF_차이[-50272] 체결강도[103.47][-0.0] 시간차이[100]
# BUY
#  code[3280.0] time[100900.0] 등락율[13.81] 거래량차이[609088] 남은매수대금[437.16682112] 현재_차이[71774] 이전_차이[-490312] DIFF_차이[562086] 체결강도[114.36][1.7543859649122808] 시간차이[0]
# ============== SUCCESS Sell[989][1005][1.2877957532861475]
# [3280][4.9781702820967935]
# SELL SUCCESS profit[4.9781702820967935]
#  code[3280.0] time[101000.0] 등락율[15.65] 거래량차이[331837] 남은매수대금[-1650.56387474] 현재_차이[-497402] 이전_차이[59660] DIFF_차이[-557062] 체결강도[114.86][-0.0] 시간차이[0]
# [3280][4.9781702820967935]
# [7280][0]
# BUY
#  code[7460.0] time[90200.0] 등락율[4.32] 거래량차이[203866] 남은매수대금[108.1916862] 현재_차이[53070] 이전_차이[-34962] DIFF_차이[88032] 체결강도[306.1][-4.901960784313726] 시간차이[100]
# ============== SUCCESS Sell[2295][2325][0.9771895424836601]
# [7460][0.9771895424836601]
# SELL SUCCESS profit[0.9771895424836601]
#  code[7460.0] time[90300.0] 등락율[5.68] 거래량차이[156863] 남은매수대금[32.79064152] 현재_차이[20904] 이전_차이[53703] DIFF_차이[-32799] 체결강도[253.06][6.719367588932807] 시간차이[100]
# BUY
#  code[7460.0] time[105700.0] 등락율[12.95] 거래량차이[927092] 남은매수대금[728.1844114] 현재_차이[78545] 이전_차이[-150711] DIFF_차이[229256] 체결강도[132.11][-3.7878787878787876] 시간차이[100]
# ============== SUCCESS Sell[2485][2510][0.6760362173038228]
# [7460][1.6532257597874829]
# SELL SUCCESS profit[1.6532257597874829]
#  code[7460.0] time[105900.0] 등락율[14.09] 거래량차이[306459] 남은매수대금[-486.55882512] 현재_차이[-158768] 이전_차이[-106278] DIFF_차이[-52490] 체결강도[135.48][-0.7407407407407407] 시간차이[100]
# [7460][1.6532257597874829]
# BUY
#  code[12280.0] time[90100.0] 등락율[6.78] 거래량차이[428644] 남은매수대금[162.57180988] 현재_차이[37927] 이전_차이[-66539] DIFF_차이[104466] 체결강도[153.39][207.18954248366012] 시간차이[0]
# ============== SUCCESS Sell[1575][1605][1.5747619047619046]
# [12280][1.5747619047619046]
# SELL SUCCESS profit[1.5747619047619046]
#  code[12280.0] time[90300.0] 등락율[8.81] 거래량차이[211042] 남은매수대금[-45.15454632] 현재_차이[-21396] 이전_차이[5308] DIFF_차이[-26704] 체결강도[142.36][-4.929577464788733] 시간차이[100]
# [12280][1.5747619047619046]
# BUY
#  code[21050.0] time[90100.0] 등락율[8.56] 거래량차이[676512] 남은매수대금[360.65531232] 현재_차이[53311] 이전_차이[0] DIFF_차이[53311] 체결강도[252.46][0] 시간차이[0]
# ============== SUCCESS Sell[1585][1605][0.9318296529968453]
# [21050][0.9318296529968453]
# SELL SUCCESS profit[0.9318296529968453]
#  code[21050.0] time[90300.0] 등락율[9.93] 거래량차이[176997] 남은매수대금[149.71468242] 현재_차이[84586] 이전_차이[74721] DIFF_차이[9865] 체결강도[138.12][-13.768115942028986] 시간차이[0]
# [21050][0.9318296529968453]
# [72130][0]
# [500027][0]
# [500032][0]
# [530036][0]
# >>DAY[20191119] - Profit[9.137987599643026]
# ======================================================
# BUY
#  code[3280.0] time[90800.0] 등락율[1.26] 거래량차이[222582] 남은매수대금[464.81353896] 현재_차이[208828] 이전_차이[15595] DIFF_차이[193233] 체결강도[75.99][-1.3333333333333333] 시간차이[0]
# ============== FAILED Sell[806][782][-3.307667493796526]
# [3280][-3.307667493796526]
# SELL FAILED profit[-3.307667493796526]
#  code[3280.0] time[91700.0] 등락율[-1.76] 거래량차이[188631] 남은매수대금[-68.95594836] 현재_차이[-36556] 이전_차이[22447] DIFF_차이[-59003] 체결강도[63.58][4.761904761904762] 시간차이[0]
# [3280][-3.307667493796526]
# [3580][0]
# [9310][0]
# [10420][0]
# BUY
#  code[11300.0] time[91900.0] 등락율[1.45] 거래량차이[165982] 남은매수대금[139.84647428] 현재_차이[84254] 이전_차이[49594] DIFF_차이[34660] 체결강도[80.51][6.25] 시간차이[0]
# ============== SUCCESS Sell[561][567][0.7395187165775399]
# [11300][0.7395187165775399]
# SELL SUCCESS profit[0.7395187165775399]
#  code[11300.0] time[92200.0] 등락율[2.53] 거래량차이[88494] 남은매수대금[102.12030612] 현재_차이[115398] 이전_차이[75513] DIFF_차이[39885] 체결강도[80.8][-0.0] 시간차이[100]
# BUY
#  code[11300.0] time[93200.0] 등락율[13.38] 거래량차이[274505] 남은매수대금[143.0829862] 현재_차이[52124] 이전_차이[7901] DIFF_차이[44223] 체결강도[93.47][-6.451612903225806] 시간차이[0]
# ============== SUCCESS Sell[627][640][1.7433652312599683]
# [11300][2.482883947837508]
# SELL SUCCESS profit[2.482883947837508]
#  code[11300.0] time[93300.0] 등락율[15.73] 거래량차이[480413] 남은매수대금[-117.46578263] 현재_차이[-24451] 이전_차이[-13992] DIFF_차이[-10459] 체결강도[98.81][-6.122448979591836] 시간차이[0]
# [11300][2.482883947837508]
# [26940][0]
# [33180][0]
# [214330][0]
# [500027][0]
# [530036][0]
# >>DAY[20191120] - Profit[-0.8247835459590176]
# ======================================================
# [2790][0]
# [3000][0]
# BUY
#  code[3280.0] time[90100.0] 등락율[4.74] 거래량차이[309130] 남은매수대금[248.0860989] 현재_차이[80253] 이전_차이[0] DIFF_차이[80253] 체결강도[243.17][0] 시간차이[0]
# ============== SUCCESS Sell[752][760][0.7338297872340425]
# [3280][0.7338297872340425]
# SELL SUCCESS profit[0.7338297872340425]
#  code[3280.0] time[90400.0] 등락율[5.85] 거래량차이[242928] 남은매수대금[-147.07589904] 현재_차이[-60543] 이전_차이[-102627] DIFF_차이[42084] 체결강도[199.13][-17.08542713567839] 시간차이[100]
# BUY
#  code[3280.0] time[92100.0] 등락율[5.85] 거래량차이[290282] 남은매수대금[169.08345936] 현재_차이[58248] 이전_차이[-57605] DIFF_차이[115853] 체결강도[156.67][4.487179487179487] 시간차이[0]
# ============== SUCCESS Sell[760][783][2.6963157894736844]
# [3280][3.430145576707727]
# SELL SUCCESS profit[3.430145576707727]
#  code[3280.0] time[92300.0] 등락율[9.05] 거래량차이[552487] 남은매수대금[-165.53063007] 현재_차이[-29961] 이전_차이[49011] DIFF_차이[-78972] 체결강도[166.02][-11.44578313253012] 시간차이[0]
# BUY
#  code[3280.0] time[92400.0] 등락율[12.26] 거래량차이[892371] 남은매수대금[232.58757744] 현재_차이[26064] 이전_차이[-17799] DIFF_차이[43863] 체결강도[168.69][-0.0] 시간차이[0]
# ============== SUCCESS Sell[806][822][1.6551116625310172]
# [3280][5.085257239238744]
# SELL SUCCESS profit[5.085257239238744]
#  code[3280.0] time[92700.0] 등락율[14.48] 거래량차이[325922] 남은매수대금[-230.64848096] 현재_차이[-70768] 이전_차이[79143] DIFF_차이[-149911] 체결강도[159.84][-3.144654088050314] 시간차이[100]
# [3280][5.085257239238744]
# [5870][0]
# BUY
#  code[11300.0] time[90800.0] 등락율[17.45] 거래량차이[392471] 남은매수대금[720.6944973] 현재_차이[183630] 이전_차이[-11404] DIFF_차이[195034] 체결강도[218.04][19.724770642201833] 시간차이[0]
# ============== SUCCESS Sell[572][590][2.816853146853147]
# [11300][2.816853146853147]
# SELL SUCCESS profit[2.816853146853147]
#  code[11300.0] time[90900.0] 등락율[21.15] 거래량차이[338553] 남은매수대금[36.8684217] 현재_차이[10890] 이전_차이[183630] DIFF_차이[-172740] 체결강도[217.23][0.4608294930875576] 시간차이[100]
# [11300][2.816853146853147]
# [261220][0]
# [267850][0]
# [285130][0]
# [500019][0]
# [530031][0]
# >>DAY[20191121] - Profit[7.902110386091891]
# ======================================================
# [4200][0]
# [6340][0]
# [00680K][0]
# BUY
#  code[11300.0] time[90100.0] 등락율[8.06] 거래량차이[580034] 남은매수대금[117.56709146] 현재_차이[20269] 이전_차이[0] DIFF_차이[20269] 체결강도[164.82][0] 시간차이[0]
# ============== SUCCESS Sell[684][692][0.8395906432748537]
# [11300][0.8395906432748537]
# SELL SUCCESS profit[0.8395906432748537]
#  code[11300.0] time[90200.0] 등락율[9.32] 거래량차이[414773] 남은매수대금[11.2403483] 현재_차이[2710] 이전_차이[-17672] DIFF_차이[20382] 체결강도[111.27][-36.03603603603603] 시간차이[0]
# BUY
#  code[11300.0] time[90300.0] 등락율[10.58] 거래량차이[625008] 남은매수대금[196.55876592] 현재_차이[31449] 이전_차이[2710] DIFF_차이[28739] 체결강도[128.49][-13.28125] 시간차이[100]
# ============== FAILED Sell[700][686][-2.33]
# [11300][-1.4904093567251464]
# SELL FAILED profit[-1.4904093567251464]
#  code[11300.0] time[90300.0] 등락율[8.37] 거래량차이[329983] 남은매수대금[231.72066226] 현재_차이[70222] 이전_차이[31449] DIFF_차이[38773] 체결강도[109.99][17.431192660550458] 시간차이[0]
# BUY
#  code[11300.0] time[93000.0] 등락율[15.48] 거래량차이[619565] 남은매수대금[699.99073265] 현재_차이[112981] 이전_차이[-131632] DIFF_차이[244613] 체결강도[106.33][-11.320754716981131] 시간차이[100]
# ============== SUCCESS Sell[731][771][5.1419562243502055]
# [11300][3.651546867625059]
# SELL SUCCESS profit[3.651546867625059]
#  code[11300.0] time[93300.0] 등락율[21.8] 거래량차이[562929] 남은매수대금[91.14946368] 현재_차이[16192] 이전_차이[-5389] DIFF_차이[21581] 체결강도[115.33][-10.434782608695652] 시간차이[0]
# BUY
#  code[11300.0] time[94100.0] 등락율[14.38] 거래량차이[490243] 남은매수대금[303.76436766] 현재_차이[61962] 이전_차이[28761] DIFF_차이[33201] 체결강도[104.9][0.9615384615384615] 시간차이[0]
# ============== FAILED Sell[724][711][-2.1255801104972374]
# [11300][1.5259667571278217]
# SELL FAILED profit[1.5259667571278217]
#  code[11300.0] time[94400.0] 등락율[12.32] 거래량차이[325229] 남은매수대금[33.50509158] 현재_차이[10302] 이전_차이[43385] DIFF_차이[-33083] 체결강도[98.62][4.081632653061225] 시간차이[100]
# [11300][1.5259667571278217]
# [36420][0]
# [133820][0]
# [261220][0]
# [28513K][0]
# [500019][0]
# [530031][0]
# >>DAY[20191122] - Profit[1.5259667571278217]
# ======================================================
# TOTAL Profit[23.439519791118016]
#
# Process finished with exit code 0

def is_trade(self, debug):
    is_trade = ''
    if self.index == 0:
        self.index += 1
        self.남은매수대금.append(0)
        return ('', '')

    시간차이 = int(self.df['시간'][self.index]) - int(self.df['시간'][self.index - 1])
    거래량차이 = int(self.df['거래량'][self.index]) - int(self.df['거래량'][self.index - 1])
    이전_시간_매수_매도_차이 = int(self.df['매수잔량'][self.index - 1]) - int(self.df['매도잔량'][self.index - 1])
    현재_시간_매수_매도_차이 = int(self.df['매수잔량'][self.index]) - int(self.df['매도잔량'][self.index])
    이전시간_현재시간_매수_매도_차이 = 현재_시간_매수_매도_차이 - 이전_시간_매수_매도_차이

    self.거래량_차이_리스트.append(거래량차이)
    self.현재_시간_매수_매도_차이_리스트.append(현재_시간_매수_매도_차이)
    self.이전시간_현재시간_매수_매도_차이_리스트.append(이전시간_현재시간_매수_매도_차이)

    if 거래량차이 > self.max_volume:
        self.max_volume = 거래량차이;

    남은매수대금 = (현재_시간_매수_매도_차이 * 거래량차이) / 100000000
    self.남은매수대금.append(남은매수대금)

    print_log = 'code[%s] time[%s] 등락율[%s] 거래량차이[%s] 남은매수대금[%s] 현재_차이[%s] 이전_차이[%s] DIFF_차이[%s] 체결강도[%s][%s] 시간차이[%s]' % (
        self.df['단축코드'][self.index], self.df['시간'][self.index], self.df['등락율'][self.index], 거래량차이, 남은매수대금,
        현재_시간_매수_매도_차이, 이전_시간_매수_매도_차이,
        이전시간_현재시간_매수_매도_차이, self.df['체결강도'][self.index],
        get_percent(int(self.df['체결강도'][self.index]), int(self.df['체결강도'][self.index - 1])), 시간차이)

    if debug is True:
        print(print_log)

    if self.is_buy is False \
            and 이전시간_현재시간_매수_매도_차이 > 0 \
            and 현재_시간_매수_매도_차이 > 0 \
            and int(self.df['등락율'][self.index]) <= 20 \
            and self.df['등락율'][self.index] > 0 \
            and 거래량차이 > self.max_volume / 2 \
            and 남은매수대금 > 100:

        self.buy_list.append([self.index])
        self.real_buy_percent = float(self.df['등락율'][self.index])
        self.등략율_list.append(self.df['등락율'][self.index])
        self.is_buy = True
        self.buy_count += 1
        self.preBuyPrice = int(self.df['종가'][self.index])
        if debug is True:
            print('============== Buy')
        if self.index == len(self.df.index) - 1:
            is_trade = 'buy'

    # if self.is_buy is True \
    #         and 남은매수대금 < 0 \
    #         and self.남은매수대금[self.index-1] < 0:
    #     self.real_buy_percent = 50
    #     self.is_buy = False
    #     profit = (get_percent(self.preBuyPrice, int(self.df['종가'][self.index])) - TAX)
    #     if profit > 0:
    #         self.test_success_sell_index_list.append(self.index)
    #         self.test_success_sell_price_list.append(self.df['등락율'][self.index])
    #         if debug is True:
    #             print('============== SUCCESS Sell[%s][%s][%s]' % (
    #             self.preBuyPrice, int(self.df['종가'][self.index]), profit))
    #         if self.index == len(self.df.index) - 1:
    #             is_trade = 'sell_success'
    #     else:
    #         self.test_fail_sell_index_list.append(self.index)
    #         self.test_fail_sell_price_list.append(self.df['등락율'][self.index])
    #         if debug is True:
    #             print('============== FAILED Sell[%s][%s][%s]' % (
    #             self.preBuyPrice, int(self.df['종가'][self.index]), profit))
    #         if self.index == len(self.df.index) - 1:
    #             is_trade = 'sell_failed'
    #     self.profit += profit

    if self.is_buy is True and float(self.df['등락율'][self.index]) > self.real_buy_percent + 1.0:
        self.real_buy_percent = 50
        self.is_buy = False
        self.test_success_sell_index_list.append(self.index)
        self.test_success_sell_price_list.append(self.df['등락율'][self.index])
        profit = (get_percent(self.preBuyPrice, int(self.df['종가'][self.index])) - TAX)
        self.profit += profit
        # if debug is True:
        print('============== SUCCESS Sell[%s][%s][%s]' % (self.preBuyPrice, int(self.df['종가'][self.index]), profit))
        if self.index == len(self.df.index) - 1:
            is_trade = 'sell_success'

    if self.is_buy is True and float(self.df['등락율'][self.index]) < self.real_buy_percent - 2:
        if debug is True:
            print('============== Failed Sell')
        self.real_buy_percent = 50
        self.is_buy = False
        self.test_fail_sell_index_list.append(self.index)
        self.test_fail_sell_price_list.append(self.df['등락율'][self.index])
        profit = (get_percent(self.preBuyPrice, int(self.df['종가'][self.index])) - TAX)
        self.profit += profit
        # if debug is True:
        print('============== FAILED Sell[%s][%s][%s]' % (self.preBuyPrice, int(self.df['종가'][self.index]), profit))
        if self.index == len(self.df.index) - 1:
            is_trade = 'sell_failed'

    self.index += 1
    return (is_trade, print_log)