# C:\ProgramData\Anaconda3\envs\py35_32\python.exe C:/Users/phj/git/learningTrade/source/testApi.py
# [2210][0]
# [2990][0]
# [5690][0]
# [6490][0]
# [12630][0]
# [14820][0]
# [16580][0]
# [19170][0]
# [32350][0]
# BUY [33180][90300][9200]
#  [90300.0] [2.79] 거래량차이[284709] 남은매수대금[256.59113916] 현재_차이[90124] 이전_차이[-172726] DIFF_차이[262850] 체결강도[135.16][-42.22222222222222] 시간차이[100]
# SELL SUCCESS [33180][90300][9280]
#  [90300.0] [3.69] 거래량차이[355691] 남은매수대금[-61.3922666] 현재_차이[-17260] 이전_차이[90124] DIFF_차이[-107384] 체결강도[140.24][-3.5714285714285716] 시간차이[0]
# BUY [33180][90900][9300]
#  [90900.0] [3.91] 거래량차이[358543] 남은매수대금[194.99361055] 현재_차이[54385] 이전_차이[-242715] DIFF_차이[297100] 체결강도[129.19][15.503875968992247] 시간차이[0]
# SELL FAILED [33180][91300][9300]
#  [91300.0] [3.91] 거래량차이[102067] 남은매수대금[-2.24445333] 현재_차이[-2199] 이전_차이[92479] DIFF_차이[-94678] 체결강도[110.4][-0.0] 시간차이[0]
# [33180][0.20956521739130435]
# DAY[20191106] - Profit[0.20956521739130435]
# [2320][0]
# [2780][0]
# [4170][0]
# [7700][0]
# [9580][0]
# [19170][0]
# [20000][0]
# [33180][0.20956521739130435]
# [74610][0]
# [229640][0]
# [249420][0]
# DAY[20191107] - Profit[0.20956521739130435]
# BUY [1210][100500][3900]
#  [100500.0] [9.55] 거래량차이[47797] 남은매수대금[10.80259997] 현재_차이[22601] 이전_차이[19456] DIFF_차이[3145] 체결강도[88.6][2.272727272727273] 시간차이[100]
# SELL SUCCESS [1210][100700][3945]
#  [100700.0] [10.81] 거래량차이[8641] 남은매수대금[0.51284335] 현재_차이[5935] 이전_차이[22601] DIFF_차이[-16666] 체결강도[88.79][-0.0] 시간차이[200]
# [1210][0.8238461538461537]
# BUY [1360][93600][5830]
#  [93600.0] [12.55] 거래량차이[586492] 남은매수대금[245.69322864] 현재_차이[41892] 이전_차이[-58173] DIFF_차이[100065] 체결강도[124.28][-0.8064516129032259] 시간차이[100]
# SELL FAILED [1360][93800][5740]
#  [93800.0] [10.81] 거래량차이[560138] 남은매수대금[415.12947456] 현재_차이[74112] 이전_차이[41892] DIFF_차이[32220] 체결강도[118.31][5.084745762711865] 시간차이[200]
# [1360][-1.8737392795883363]
# [2990][0]
# [2995][0]
# BUY [3280][93400][525]
#  [93400.0] [4.17] 거래량차이[285584] 남은매수대금[783.53968576] 현재_차이[274364] 이전_차이[-177929] DIFF_차이[452293] 체결강도[69.62][-0.0] 시간차이[100]
# SELL SUCCESS [3280][93700][530]
#  [93700.0] [5.16] 거래량차이[91621] 남은매수대금[-48.7606962] 현재_차이[-53220] 이전_차이[90164] DIFF_차이[-143384] 체결강도[70.78][-1.4285714285714286] 시간차이[100]
# BUY [3280][102700][506]
#  [102700.0] [0.4] 거래량차이[207772] 남은매수대금[405.415115] 현재_차이[195125] 이전_차이[181773] DIFF_차이[13352] 체결강도[61.18][1.639344262295082] 시간차이[100]
# SELL SUCCESS [3280][103100][517]
#  [103100.0] [2.58] 거래량차이[296301] 남은매수대금[-409.23020013] 현재_차이[-138113] 이전_차이[173993] DIFF_차이[-312106] 체결강도[64.42][-3.125] 시간차이[100]
# [3280][2.466293995859213]
# [3350][0]
# BUY [6490][93300][4020]
#  [93300.0] [7.06] 거래량차이[17453568] 남은매수대금[20472.51165696] 현재_차이[117297] 이전_차이[62053] DIFF_차이[55244] 체결강도[107.21][-47.66355140186916] 시간차이[-59700]
# SELL FAILED [6490][93400][3975]
#  [93400.0] [5.86] 거래량차이[388863] 남은매수대금[540.43013151] 현재_차이[138977] 이전_차이[117297] DIFF_차이[21680] 체결강도[104.5][2.8846153846153846] 시간차이[100]
# [6490][-1.4494029850746268]
# [10770][0]
# [16380][0]
# BUY [20560][110500][5370]
#  [110500.0] [1.13] 거래량차이[59102] 남은매수대금[24.42567456] 현재_차이[41328] 이전_차이[-40206] DIFF_차이[81534] 체결강도[84.43][2.380952380952381] 시간차이[200]
# SELL SUCCESS [20560][114400][5420]
#  [114400.0] [2.07] 거래량차이[13423] 남은매수대금[-16.30558925] 현재_차이[-121475] 이전_차이[52120] DIFF_차이[-173595] 체결강도[81.15][-1.2345679012345678] 시간차이[100]
# [20560][0.6010986964618248]
# BUY [25620][93500][5670]
#  [93500.0] [16.43] 거래량차이[182312] 남은매수대금[31.97023232] 현재_차이[17536] 이전_차이[-32002] DIFF_차이[49538] 체결강도[107.01][-0.0] 시간차이[100]
# SELL FAILED [25620][93800][5610]
#  [93800.0] [15.2] 거래량차이[92984] 남은매수대금[104.64977264] 현재_차이[112546] 이전_차이[78229] DIFF_차이[34317] 체결강도[103.37][1.941747572815534] 시간차이[100]
# BUY [25620][100300][5720]
#  [100300.0] [17.45] 거래량차이[370994] 남은매수대금[75.56034798] 현재_차이[20367] 이전_차이[-80343] DIFF_차이[100710] 체결강도[105.27][-0.0] 시간차이[200]
# SELL FAILED [25620][100500][5660]
#  [100500.0] [16.22] 거래량차이[146185] 남은매수대금[60.15074195] 현재_차이[41147] 이전_차이[5028] DIFF_차이[36119] 체결강도[101.9][2.9702970297029703] 시간차이[100]
# [25620][-2.767152107152107]
# [69460][0]
# [123690][0]
# [214420][0]
# [500030][0]
# [500035][0]
# [500036][0]
# [530062][0]
# [550045][0]
# DAY[20191108] - Profit[-2.1990555256478785]
# [1060][0]
# [1525][0]
# [1527][0]
# BUY [3560][125200][2010]
#  [125200.0] [12.29] 거래량차이[1186166] 남은매수대금[81.44215756] 현재_차이[6866] 이전_차이[-264628] DIFF_차이[271494] 체결강도[145.03][-7.586206896551724] 시간차이[100]
# SELL SUCCESS [3560][125300][2030]
#  [125300.0] [13.41] 거래량차이[146749] 남은매수대금[-77.02268014] 현재_차이[-52486] 이전_차이[6866] DIFF_차이[-59352] 체결강도[144.89][0.6944444444444444] 시간차이[100]
# BUY [3560][125600][2020]
#  [125600.0] [12.85] 거래량차이[1186997] 남은매수대금[799.14573025] 현재_차이[67325] 이전_차이[-52486] DIFF_차이[119811] 체결강도[142.63][1.4084507042253522] 시간차이[100]
# SELL FAILED [3560][125700][2015]
#  [125700.0] [12.57] 거래량차이[447596] 남은매수대금[-90.54419484] 현재_차이[-20229] 이전_차이[67325] DIFF_차이[-87554] 체결강도[139.67][2.1582733812949644] 시간차이[100]
# BUY [3560][125900][2110]
#  [125900.0] [17.88] 거래량차이[1674138] 남은매수대금[1681.90600032] 현재_차이[100464] 이전_차이[-24829] DIFF_차이[125293] 체결강도[147.28][-2.7210884353741496] 시간차이[100]
# SELL SUCCESS [3560][130000][2150]
#  [130000.0] [20.11] 거래량차이[1464845] 남은매수대금[-264.9904605] 현재_차이[-18090] 이전_차이[100464] DIFF_차이[-118554] 체결강도[143.23][2.7972027972027975] 시간차이[4100]
# BUY [3560][142800][2000]
#  [142800.0] [11.73] 거래량차이[974370] 남은매수대금[1785.435588] 현재_차이[183240] 이전_차이[-173768] DIFF_차이[357008] 체결강도[114.43][1.7543859649122808] 시간차이[200]
# SELL FAILED [3560][143000][1970]
#  [143000.0] [10.06] 거래량차이[833031] 남은매수대금[1630.59154002] 현재_차이[195742] 이전_차이[84904] DIFF_차이[110838] 체결강도[112.51][0.8928571428571428] 시간차이[100]
# [3560][-0.17676527969695943]
# [7280][0]
# [20000][0]
# BUY [24900][90400][1430]
#  [90400.0] [16.73] 거래량차이[526250] 남은매수대금[148.749825] 현재_차이[28266] 이전_차이[0] DIFF_차이[28266] 체결강도[133.25][1] 시간차이[100]
# SELL SUCCESS [24900][90500][1465]
#  [90500.0] [19.59] 거래량차이[573138] 남은매수대금[-263.39703066] 현재_차이[-45957] 이전_차이[28266] DIFF_차이[-74223] 체결강도[144.54][-7.638888888888889] 시간차이[100]
# [24900][2.1175524475524474]
# [26940][0]
# [37560][0]
# [39570][0]
# [69460][0]
# [72130][0]
# [163560][0]
# [195920][0]
# [253250][0]
# BUY [267850][90400][24050]
#  [90400.0] [6.18] 거래량차이[218470] 남은매수대금[53.2236614] 현재_차이[24362] 이전_차이[1640] DIFF_차이[22722] 체결강도[124.15][30.64516129032258] 시간차이[100]
# SELL SUCCESS [267850][90600][24300]
#  [90600.0] [7.28] 거래량차이[40166] 남은매수대금[-2.2533126] 현재_차이[-5610] 이전_차이[11041] DIFF_차이[-16651] 체결강도[117.71][-0.8547008547008548] 시간차이[100]
# [267850][0.7095010395010395]
# [334700][0]
# [500022][0]
# [500032][0]
# [530038][0]
# DAY[20191111] - Profit[2.6502882073565273]
# [1360][-1.8737392795883363]
# [1527][0]
# [5257][0]
# [6390][0]
# [00781K][0]
# [12450][0]
# BUY [20560][111300][6380]
#  [111300.0] [9.43] 거래량차이[706481] 남은매수대금[362.1421606] 현재_차이[51260] 이전_차이[-513345] DIFF_차이[564605] 체결강도[158.89][4.430379746835443] 시간차이[100]
# SELL SUCCESS [20560][111400][6410]
#  [111400.0] [9.95] 거래량차이[621603] 남은매수대금[-3633.58655253] 현재_차이[-584551] 이전_차이[51260] DIFF_차이[-635811] 체결강도[154.83][2.5974025974025974] 시간차이[100]
# BUY [20560][142600][6860]
#  [142600.0] [17.67] 거래량차이[2345659] 남은매수대금[2091.8586962] 현재_차이[89180] 이전_차이[-460448] DIFF_차이[549628] 체결강도[130.81][-3.0769230769230766] 시간차이[100]
# SELL SUCCESS [20560][142900][6910]
#  [142900.0] [18.52] 거래량차이[1218304] 남은매수대금[-11996.71258624] 현재_차이[-984706] 이전_차이[175413] DIFF_차이[-1160119] 체결강도[129.55][-0.7751937984496123] 시간차이[100]
# [20560][1.140181105959435]
# [33250][0]
# [39570][0]
# [81660][0]
# [97950][0]
# [118000][0]
# [181480][0]
# [267850][0.7095010395010395]
# [317400][0]
# [334700][0]
# [500032][0]
# [530038][0]
# DAY[20191112] - Profit[-0.024057134127861923]
# [1065][0]
# [1210][0.8238461538461537]
# [1525][0]
# [1527][0]
# [3780][0]
# [4250][0]
# [5725][0]
# [5750][0]
# [9415][0]
# [17370][0]
# [20560][1.140181105959435]
# BUY [39570][90400][14350]
#  [90400.0] [6.3] 거래량차이[677900] 남은매수대금[222.656255] 현재_차이[32845] 이전_차이[0] DIFF_차이[32845] 체결강도[114.06][1] 시간차이[100]
# SELL SUCCESS [39570][90500][15200]
#  [90500.0] [12.59] 거래량차이[313095] 남은매수대금[-35.3546874] 현재_차이[-11292] 이전_차이[32845] DIFF_차이[-44137] 체결강도[156.84][-26.923076923076923] 시간차이[100]
# [39570][5.593344947735192]
# [51630][0]
# [77500][0]
# BUY [82740][92000][4785]
#  [92000.0] [10.51] 거래량차이[95030] 남은매수대금[10.9493566] 현재_차이[11522] 이전_차이[-26703] DIFF_차이[38225] 체결강도[197.25][-6.091370558375635] 시간차이[100]
# SELL FAILED [82740][92100][4695]
#  [92100.0] [8.43] 거래량차이[100144] 남은매수대금[0.44664224] 현재_차이[446] 이전_차이[11522] DIFF_차이[-11076] 체결강도[170.78][15.882352941176471] 시간차이[100]
# [82740][-2.2108777429467086]
# [112610][0]
# [118000][0]
# [163560][0]
# BUY [298690][90300][9800]
#  [90300.0] [5.15] 거래량차이[914361] 남은매수대금[469.83525624] 현재_차이[51384] 이전_차이[-343284] DIFF_차이[394668] 체결강도[80.93][31.25] 시간차이[100]
# SELL SUCCESS [298690][90500][9860]
#  [90500.0] [5.79] 거래량차이[504907] 남은매수대금[-347.12861157] 현재_차이[-68751] 이전_차이[60373] DIFF_차이[-129124] 체결강도[77.36][-6.4935064935064934] 시간차이[100]
# [298690][0.28224489795918367]
# [500041][0]
# DAY[20191113] - Profit[5.628739362553255]
# BUY [1360][100300][5050]
#  [100300.0] [6.43] 거래량차이[776051] 남은매수대금[322.03012296] 현재_차이[41496] 이전_차이[0] DIFF_차이[41496] 체결강도[41.14][1] 시간차이[0]
# SELL SUCCESS [1360][100400][5190]
#  [100400.0] [9.38] 거래량차이[168637] 남은매수대금[-142.90973928] 현재_차이[-84744] 이전_차이[41496] DIFF_차이[-126240] 체결강도[69.01][-40.57971014492754] 시간차이[100]
# [1360][0.5685379481344357]
# [2720][0]
# [3550][0]
# [3850][0]
# [5110][0]
# BUY [19170][100200][7690]
#  [100200.0] [6.66] 거래량차이[105478] 남은매수대금[18.71601632] 현재_차이[17744] 이전_차이[-58965] DIFF_차이[76709] 체결강도[143.22][9.79020979020979] 시간차이[0]
# SELL FAILED [19170][100400][7580]
#  [100400.0] [5.13] 거래량차이[101089] 남은매수대금[32.8842517] 현재_차이[32530] 이전_차이[3756] DIFF_차이[28774] 체결강도[86.07][20.930232558139537] 시간차이[100]
# [19170][-1.7604291287386216]
# BUY [33180][100200][9240]
#  [100200.0] [9.87] 거래량차이[578635] 남은매수대금[169.81201345] 현재_차이[29347] 이전_차이[-15813] DIFF_차이[45160] 체결강도[203.14][-2.4630541871921183] 시간차이[0]
# SELL SUCCESS [33180][100300][9360]
#  [100300.0] [11.3] 거래량차이[742857] 남은매수대금[506.67304542] 현재_차이[68206] 이전_차이[29347] DIFF_차이[38859] 체결강도[217.07][-6.451612903225807] 시간차이[100]
# [33180][1.178266516092603]
# [35420][0]
# [63160][0]
# [336260][0]
# DAY[20191114] - Profit[-0.013624664511582951]
# BUY [1140][134900][3675]
#  [134900.0] [6.21] 거래량차이[69991] 남은매수대금[17.19818852] 현재_차이[24572] 이전_차이[6048] DIFF_차이[18524] 체결강도[88.01][-0.0] 시간차이[0]
# SELL SUCCESS [1140][135300][3690]
#  [135300.0] [6.65] 거래량차이[42156] 남은매수대금[-5.22860868] 현재_차이[-12403] 이전_차이[6712] DIFF_차이[-19115] 체결강도[88.04][-1.1363636363636365] 시간차이[100]
# [1140][0.07816326530612244]
# [1630][0]
# [nan][0]
# [2170][0]
# BUY [2760][90200][2340]
#  [90200.0] [12.77] 거래량차이[641574] 남은매수대금[460.6822107] 현재_차이[71805] 이전_차이[-56332] DIFF_차이[128137] 체결강도[201.63][-3.4825870646766175] 시간차이[100]
# SELL SUCCESS [2760][90300][2390]
#  [90300.0] [15.18] 거래량차이[620247] 남은매수대금[140.36809857] 현재_차이[22631] 이전_차이[71805] DIFF_차이[-49174] 체결강도[169.47][18.93491124260355] 시간차이[100]
# [2760][1.8067521367521366]
# BUY [3280][90300][599]
#  [90300.0] [16.31] 거래량차이[639678] 남은매수대금[450.67873812] 현재_차이[70454] 이전_차이[0] DIFF_차이[70454] 체결강도[150.0][1] 시간차이[0]
# SELL SUCCESS [3280][90400][604]
#  [90400.0] [17.28] 거래량차이[328980] 남은매수대금[-299.3487714] 현재_차이[-90993] 이전_차이[70454] DIFF_차이[-161447] 체결강도[125.5][20.0] 시간차이[100]
# [3280][2.971018536760716]
# [3580][0]
# [6490][-1.4494029850746268]
# [12510][0]
# [12630][0]
# BUY [21050][135200][1345]
#  [135200.0] [1.89] 거래량차이[11653] 남은매수대금[18.0563235] 현재_차이[154950] 이전_차이[134810] DIFF_차이[20140] 체결강도[91.4][-0.0] 시간차이[100]
# SELL FAILED [21050][135500][1325]
#  [135500.0] [0.38] 거래량차이[47603] 남은매수대금[51.47026772] 현재_차이[108124] 이전_차이[150035] DIFF_차이[-41911] 체결강도[90.28][1.1111111111111112] 시간차이[0]
# BUY [21050][135600][1325]
#  [135600.0] [0.38] 거래량차이[28230] 남은매수대금[40.9989936] 현재_차이[145232] 이전_차이[108124] DIFF_차이[37108] 체결강도[89.79][1.1235955056179776] 시간차이[100]
# SELL FAILED [21050][141000][1310]
#  [141000.0] [-0.76] 거래량차이[504] 남은매수대금[1.0232208] 현재_차이[203020] 이전_차이[201696] DIFF_차이[1324] 체결강도[87.77][-0.0] 시간차이[0]
# BUY [21050][153000][1325]
#  [153000.0] [0.38] 거래량차이[62402] 남은매수대금[129.00115852] 현재_차이[206726] 이전_차이[205727] DIFF_차이[999] 체결강도[87.39][-0.0] 시간차이[1000]
# [21050][-3.2790643192817566]
# [23800][0]
# BUY [44380][135300][438]
#  [135300.0] [2.82] 거래량차이[19839] 남은매수대금[47.73898248] 현재_차이[240632] 이전_차이[213843] DIFF_차이[26789] 체결강도[93.53][-0.0] 시간차이[100]
# SELL SUCCESS [44380][142200][443]
#  [142200.0] [3.99] 거래량차이[3968] 남은매수대금[1.0531072] 현재_차이[26540] 이전_차이[24825] DIFF_차이[1715] 체결강도[91.19][-0.0] 시간차이[0]
# BUY [44380][143500][446]
#  [143500.0] [4.69] 거래량차이[71155] 남은매수대금[45.7341647] 현재_차이[64274] 이전_차이[18101] DIFF_차이[46173] 체결강도[95.38][-2.1052631578947367] 시간차이[0]
# SELL FAILED [44380][144300][441]
#  [144300.0] [3.52] 거래량차이[11937] 남은매수대금[12.4849083] 현재_차이[104590] 이전_차이[100207] DIFF_차이[4383] 체결강도[94.09][-0.0] 시간차이[0]
# BUY [44380][152000][451]
#  [152000.0] [5.87] 거래량차이[47039] 남은매수대금[13.0439147] 현재_차이[27730] 이전_차이[7013] DIFF_차이[20717] 체결강도[97.47][1.0309278350515465] 시간차이[0]
# SELL FAILED [44380][153000][448]
#  [153000.0] [5.16] 거래량차이[71782] 남은매수대금[-23.65504028] 현재_차이[-32954] 이전_차이[-32954] DIFF_차이[0] 체결강도[97.47][-0.0] 시간차이[0]
# [44380][-1.6347121918348504]
# [58730][0]
# [272210][0]
# BUY [336260][90500][8340]
#  [90500.0] [5.7] 거래량차이[154488] 남은매수대금[11.15712336] 현재_차이[7222] 이전_차이[-32507] DIFF_차이[39729] 체결강도[165.21][19.393939393939394] 시간차이[0]
# SELL SUCCESS [336260][90600][8450]
#  [90600.0] [7.1] 거래량차이[59079] 남은매수대금[-41.74049508] 현재_차이[-70652] 이전_차이[7222] DIFF_차이[-77874] 체결강도[162.4][1.8518518518518516] 시간차이[100]
# BUY [336260][91800][9050]
#  [91800.0] [14.7] 거래량차이[343153] 남은매수대금[15.17079413] 현재_차이[4421] 이전_차이[-43669] DIFF_차이[48090] 체결강도[157.9][1.910828025477707] 시간차이[100]
# SELL SUCCESS [336260][91800][9130]
#  [91800.0] [15.72] 거래량차이[275967] 남은매수대금[12.02112252] 현재_차이[4356] 이전_차이[4421] DIFF_차이[-65] 체결강도[157.59][-0.0] 시간차이[0]
# BUY [336260][91900][9060]
#  [91900.0] [14.83] 거래량차이[205082] 남은매수대금[16.22813866] 현재_차이[7913] 이전_차이[4356] DIFF_차이[3557] 체결강도[149.03][5.369127516778524] 시간차이[100]
# SELL SUCCESS [336260][92000][9090]
#  [92000.0] [15.21] 거래량차이[169458] 남은매수대금[-68.17125882] 현재_차이[-40229] 이전_차이[37693] DIFF_차이[-77922] 체결강도[142.95][2.1126760563380285] 시간차이[100]
# BUY [336260][92200][9190]
#  [92200.0] [16.48] 거래량차이[250708] 남은매수대금[94.48181688] 현재_차이[37686] 이전_차이[-7483] DIFF_차이[45169] 체결강도[142.19][4.929577464788733] 시간차이[100]
# SELL SUCCESS [336260][92300][9320]
#  [92300.0] [18.12] 거래량차이[183619] 남은매수대금[-54.03539932] 현재_차이[-29428] 이전_차이[18987] DIFF_차이[-48415] 체결강도[140.76][-2.142857142857143] 시간차이[0]
# BUY [336260][92400][9450]
#  [92400.0] [19.77] 거래량차이[299413] 남은매수대금[55.55608215] 현재_차이[18555] 이전_차이[-29428] DIFF_차이[47983] 체결강도[144.01][-2.7777777777777777] 시간차이[100]
# SELL SUCCESS [336260][92500][9540]
#  [92500.0] [20.91] 거래량차이[328736] 남은매수대금[227.67926624] 현재_차이[69259] 이전_차이[18555] DIFF_차이[50704] 체결강도[147.05][-2.0408163265306123] 시간차이[100]
# BUY [336260][93900][9390]
#  [93900.0] [19.01] 거래량차이[223879] 남은매수대금[182.98526186] 현재_차이[81734] 이전_차이[67366] DIFF_차이[14368] 체결강도[119.93][4.201680672268908] 시간차이[100]
# SELL FAILED [336260][94300][9300]
#  [94300.0] [17.87] 거래량차이[142755] 남은매수대금[128.6051244] 현재_차이[90088] 이전_차이[33681] DIFF_차이[56407] 체결강도[115.49][2.608695652173913] 시간차이[100]
# BUY [336260][134700][9080]
#  [134700.0] [15.08] 거래량차이[571487] 남은매수대금[404.51564321] 현재_차이[70783] 이전_차이[-1180] DIFF_차이[71963] 체결강도[91.32][1.0989010989010988] 시간차이[1600]
# SELL SUCCESS [336260][134900][9110]
#  [134900.0] [15.46] 거래량차이[34555] 남은매수대금[-7.9220793] 현재_차이[-22926] 이전_차이[71602] DIFF_차이[-94528] 체결강도[91.12][-1.0989010989010988] 시간차이[100]
# [336260][1.9629406133460081]
# [33626L][0]
# DAY[20191115] - Profit[0.45569505597374915]
# TOTAL Profit[6.9171157363788165]
#
# Process finished with exit code 0

def is_trade(self, debug):
    is_trade = ''
    if self.index == 0 or numpy.isnan(self.df['시간'][self.index]) or numpy.isnan(self.df['시간'][self.index - 1]):
        self.index += 1
        return ('', '')

    시간차이 = int(self.df['시간'][self.index]) - int(self.df['시간'][self.index - 1])
    거래량차이 = int(self.df['거래량'][self.index]) - int(self.df['거래량'][self.index - 1])
    이전_시간_매수_매도_차이 = int(self.df['매수잔량'][self.index - 1]) - int(self.df['매도잔량'][self.index - 1])
    현재_시간_매수_매도_차이 = int(self.df['매수잔량'][self.index]) - int(self.df['매도잔량'][self.index])
    이전시간_현재시간_매수_매도_차이 = 현재_시간_매수_매도_차이 - 이전_시간_매수_매도_차이

    self.거래량_차이_리스트.append(거래량차이)
    self.현재_시간_매수_매도_차이_리스트.append(현재_시간_매수_매도_차이)
    self.이전시간_현재시간_매수_매도_차이_리스트.append(이전시간_현재시간_매수_매도_차이)

    if 거래량차이 > self.max_volume:
        self.max_volume = 거래량차이;

    남은매수대금 = (현재_시간_매수_매도_차이 * 거래량차이) / 100000000

    print_log = '[%s] [%s] 거래량차이[%s] 남은매수대금[%s] 현재_차이[%s] 이전_차이[%s] DIFF_차이[%s] 체결강도[%s][%s] 시간차이[%s]' % (
        self.df['시간'][self.index], self.df['등락율'][self.index], 거래량차이, 남은매수대금, 현재_시간_매수_매도_차이, 이전_시간_매수_매도_차이,
        이전시간_현재시간_매수_매도_차이, self.df['체결강도'][self.index],
        get_percent(int(self.df['체결강도'][self.index]), int(self.df['체결강도'][self.index - 1])), 시간차이)

    if debug is True:
        print(print_log)

        # and self.df['등락율'][self.index] > self.df['등락율'][self.index - 1] \
        # and 거래량차이 > self.max_volume / 2 \
        # and get_percent(int(self.df['체결강도'][self.index]), int(self.df['체결강도'][self.index-1])) > 0  \
    if self.is_buy is False \
            and 이전시간_현재시간_매수_매도_차이 > 0 \
            and 현재_시간_매수_매도_차이 > 0 \
            and self.df['등락율'][self.index] > 0 \
            and 남은매수대금 > 10 \
            and 거래량차이 > self.max_volume / 2 \
            and int(self.df['등락율'][self.index]) <= 20:

        self.buy_list.append([self.index])
        self.real_buy_percent = float(self.df['등락율'][self.index])
        self.등략율_list.append(self.df['등락율'][self.index])
        self.is_buy = True
        self.preBuyPrice = int(self.df['종가'][self.index])
        if debug is True:
            print('============== Buy')
        if self.index == len(self.df.index) - 1:
            is_trade = 'buy'

    if self.is_buy is True and 남은매수대금 < 0:
        self.real_buy_percent = 50
        self.is_buy = False
        profit = (get_percent(self.preBuyPrice, int(self.df['종가'][self.index])) - 0.33)
        if profit > 0:
            self.test_success_sell_index_list.append(self.index)
            self.test_success_sell_price_list.append(self.df['등락율'][self.index])
            if debug is True:
                print('============== SUCCESS Sell[%s][%s][%s]' % (
                self.preBuyPrice, int(self.df['종가'][self.index]), profit))
            if self.index == len(self.df.index) - 1:
                is_trade = 'sell_success'
        else:
            self.test_fail_sell_index_list.append(self.index)
            self.test_fail_sell_price_list.append(self.df['등락율'][self.index])
            if debug is True:
                print('============== FAILED Sell[%s][%s][%s]' % (
                self.preBuyPrice, int(self.df['종가'][self.index]), profit))
            if self.index == len(self.df.index) - 1:
                is_trade = 'sell_failed'
        self.profit += profit

    if self.is_buy is True and float(self.df['등락율'][self.index]) > self.real_buy_percent + 1.0:

        self.real_buy_percent = 50
        self.is_buy = False
        self.test_success_sell_index_list.append(self.index)
        self.test_success_sell_price_list.append(self.df['등락율'][self.index])
        profit = (get_percent(self.preBuyPrice, int(self.df['종가'][self.index])) - 0.33)
        self.profit += profit
        if debug is True:
            print(
                '============== SUCCESS Sell[%s][%s][%s]' % (self.preBuyPrice, int(self.df['종가'][self.index]), profit))
        if self.index == len(self.df.index) - 1:
            is_trade = 'sell_success'

    if self.is_buy is True and float(self.df['등락율'][self.index]) < self.real_buy_percent - 1:
        if debug is True:
            print('============== Failed Sell')

        self.real_buy_percent = 50
        self.is_buy = False
        self.test_fail_sell_index_list.append(self.index)
        self.test_fail_sell_price_list.append(self.df['등락율'][self.index])
        profit = (get_percent(self.preBuyPrice, int(self.df['종가'][self.index])) - 0.33)
        self.profit += profit
        if debug is True:
            print('============== FAILED Sell[%s][%s][%s]' % (self.preBuyPrice, int(self.df['종가'][self.index]), profit))
        if self.index == len(self.df.index) - 1:
            is_trade = 'sell_failed'

    self.index += 1
    return (is_trade, print_log)