# C:\ProgramData\Anaconda3\envs\py35_32\python.exe C:/Users/COM/git/learningTrade/source/testApi.py
# [140][0]
# BUY
#  code[3280.0] time[91400.0] 등락율[3.11] 거래량차이[1057579] 남은매수대금[440.36531981] 현재_차이[41639] 이전_차이[-133870] DIFF_차이[175509] 체결강도[93.56][-2.150537634408602] 시간차이[100]
# [3280][0.6744642857142855]
# SELL SUCCESS profit[0.6744642857142855]
#  code[3280.0] time[91400.0] 등락율[4.14] 거래량차이[256558] 남은매수대금[303.97248398] 현재_차이[118481] 이전_차이[41639] DIFF_차이[76842] 체결강도[94.32][-1.0638297872340425] 시간차이[0]
# BUY
#  code[3280.0] time[91900.0] 등락율[4.26] 거래량차이[736647] 남은매수대금[589.89955113] 현재_차이[80079] 이전_차이[-47751] DIFF_차이[127830] 체결강도[96.14][5.208333333333334] 시간차이[100]
# [3280][1.7793428729107534]
# SELL SUCCESS profit[1.7793428729107534]
#  code[3280.0] time[91900.0] 등락율[5.75] 거래량차이[231050] 남은매수대금[197.4114305] 현재_차이[85441] 이전_차이[80079] DIFF_차이[5362] 체결강도[97.81][-1.0309278350515465] 시간차이[0]
# BUY
#  code[3280.0] time[93200.0] 등락율[13.35] 거래량차이[778900] 남은매수대금[789.578719] 현재_차이[101371] 이전_차이[51442] DIFF_차이[49929] 체결강도[106.18][-1.8867924528301885] 시간차이[100]
# [3280][2.66761698458588]
# SELL SUCCESS profit[2.66761698458588]
#  code[3280.0] time[93300.0] 등락율[14.73] 거래량차이[534553] 남은매수대금[-3427.06739277] 현재_차이[-641109] 이전_차이[9460] DIFF_차이[-650569] 체결강도[105.92][-1.9047619047619047] 시간차이[0]
# BUY
#  code[3280.0] time[93500.0] 등락율[10.59] 거래량차이[618246] 남은매수대금[322.79860152] 현재_차이[52212] 이전_차이[37137] DIFF_차이[15075] 체결강도[103.02][1.941747572815534] 시간차이[0]
# [3280][3.690374528810646]
# SELL SUCCESS profit[3.690374528810646]
#  code[3280.0] time[93600.0] 등락율[12.08] 거래량차이[328757] 남은매수대금[6.3778858] 현재_차이[1940] 이전_차이[52212] DIFF_차이[-50272] 체결강도[103.47][-0.0] 시간차이[100]
# BUY
#  code[3280.0] time[100900.0] 등락율[13.81] 거래량차이[609088] 남은매수대금[437.16682112] 현재_차이[71774] 이전_차이[-490312] DIFF_차이[562086] 체결강도[114.36][1.7543859649122808] 시간차이[0]
# [3280][4.9781702820967935]
# SELL SUCCESS profit[4.9781702820967935]
#  code[3280.0] time[101000.0] 등락율[15.65] 거래량차이[331837] 남은매수대금[-1650.56387474] 현재_차이[-497402] 이전_차이[59660] DIFF_차이[-557062] 체결강도[114.86][-0.0] 시간차이[0]
# [3280][4.9781702820967935]
# [7280][0]
# BUY
#  code[7460.0] time[90200.0] 등락율[4.32] 거래량차이[203866] 남은매수대금[108.1916862] 현재_차이[53070] 이전_차이[-34962] DIFF_차이[88032] 체결강도[306.1][-4.901960784313726] 시간차이[100]
# [7460][0.9771895424836601]
# SELL SUCCESS profit[0.9771895424836601]
#  code[7460.0] time[90300.0] 등락율[5.68] 거래량차이[156863] 남은매수대금[32.79064152] 현재_차이[20904] 이전_차이[53703] DIFF_차이[-32799] 체결강도[253.06][6.719367588932807] 시간차이[100]
# BUY
#  code[7460.0] time[105700.0] 등락율[12.95] 거래량차이[927092] 남은매수대금[728.1844114] 현재_차이[78545] 이전_차이[-150711] DIFF_차이[229256] 체결강도[132.11][-3.7878787878787876] 시간차이[100]
# [7460][1.4520185163267183]
# SELL SUCCESS profit[1.4520185163267183]
#  code[7460.0] time[105800.0] 등락율[13.86] 거래량차이[460527] 남은매수대금[-722.66817894] 현재_차이[-156922] 이전_차이[126040] DIFF_차이[-282962] 체결강도[134.06][-0.7462686567164178] 시간차이[100]
# [7460][1.4520185163267183]
# BUY
#  code[12280.0] time[90100.0] 등락율[6.78] 거래량차이[428644] 남은매수대금[162.57180988] 현재_차이[37927] 이전_차이[-66539] DIFF_차이[104466] 체결강도[153.39][207.18954248366012] 시간차이[0]
# [12280][-1.2823809523809524]
# SELL FAILED profit[-1.2823809523809524]
#  code[12280.0] time[90200.0] 등락율[5.76] 거래량차이[252880] 남은매수대금[105.7392432] 현재_차이[41814] 이전_차이[37927] DIFF_차이[3887] 체결강도[129.08][18.6046511627907] 시간차이[100]
# [12280][-1.2823809523809524]
# BUY
#  code[21050.0] time[90100.0] 등락율[8.56] 거래량차이[676512] 남은매수대금[360.65531232] 현재_차이[53311] 이전_차이[0] DIFF_차이[53311] 체결강도[252.46][1] 시간차이[0]
# [21050][-0.33]
# SELL FAILED profit[-0.33]
#  code[21050.0] time[90200.0] 등락율[8.56] 거래량차이[186588] 남은매수대금[-46.0685772] 현재_차이[-24690] 이전_차이[53311] DIFF_차이[-78001] 체결강도[168.58][50.0] 시간차이[100]
# [21050][-0.33]
# [72130][0]
# [500027][0]
# [500032][0]
# [530036][0]
# >>DAY[20191119] - Profit[4.817807846042559]
# ======================================================
#
# Process finished with exit code 0
